In [1]:
import pandas as pd
import numpy as np

In [3]:
#Pandas Fonksiyonları
#Pandas kütüphanesinde kullanılan 10 adet fonksiyon

In [23]:
df = pd.DataFrame({
    "Ad": ["Ali", "Ayşe", "Ahmet", "Zeynep", "Mehmet"],
    "Yaş": [25, 30, 22, 35, 28],
    "Gelir": [5000, 6000, 5500, 7000, 5200]
})

In [24]:
df.head(3)
#ilk 3 satırı gösterir

      Ad  Yaş  Gelir
0    Ali   25   5000
1   Ayşe   30   6000
2  Ahmet   22   5500

In [25]:
df.tail(2)
#son 2 satırı gösterir

       Ad  Yaş  Gelir
3  Zeynep   35   7000
4  Mehmet   28   5200

In [26]:
df.info()
#genel bilgileri alır.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Ad      5 non-null      object
 1   Yaş     5 non-null      int64
 2   Gelir   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [27]:
df.describe()
#istatistikleri gösterir.

             Yaş        Gelir
count   5.000000     5.000000
mean   28.000000  5740.000000
std     4.949747   798.749022
min    22.000000  5000.000000
25%    25.000000  5200.000000
50%    28.000000  5500.000000
75%    30.000000  6000.000000
max    35.000000  7000.000000

In [28]:
df.isnull()
#eksik verileri kontrol eder.

      Ad    Yaş  Gelir
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [29]:
df.loc[2, "Yaş"] = None  # Ahmet'in yaşını NaN yaptım
df.fillna(0)  # Eksik değerleri 0 ile doldurdum.

       Ad   Yaş  Gelir
0     Ali  25.0   5000
1    Ayşe  30.0   6000
2   Ahmet   0.0   5500
3  Zeynep  35.0   7000
4  Mehmet  28.0   5200

In [30]:
df.dropna()
#eksik değer içeren satırları siler.

       Ad   Yaş  Gelir
0     Ali  25.0   5000
1    Ayşe  30.0   6000
3  Zeynep  35.0   7000
4  Mehmet  28.0   5200

In [31]:
df.groupby("Yaş").count()
#yaşlara göre gruplar.

      Ad  Gelir
Yaş
25.0   1      1
28.0   1      1
30.0   1      1
35.0   1      1

In [33]:
df_sorted = df.sort_values(by='Yaş')
print(df_sorted)
# Yaşa göre sıralama yapar. (küçükten büyüğe)

       Ad   Yaş  Gelir
0     Ali  25.0   5000
4  Mehmet  28.0   5200
1    Ayşe  30.0   6000
3  Zeynep  35.0   7000
2   Ahmet   NaN   5500

In [35]:
df_dropped = df.drop('Gelir', axis=1)
print(df_dropped)
# 'Gelir' sütununu sil

       Ad   Yaş
0     Ali  25.0
1    Ayşe  30.0
2   Ahmet   NaN
3  Zeynep  35.0
4  Mehmet  28.0